// region-data.js

// 1. 시/도 데이터
const regions = ['서울', '부산', '인천', '대구', '광주', '대전', '울산', '세종', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주'];

// 2. 구/군 상세 지역 데이터
const subRegionData = {
    '서울': ['서울전체', '강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'],
    '부산': ['부산전체', '강서구', '사하구', '서구', '수영구', '연제구', '영도구', '중구', '해운대구', '금정구', '기장군', '남구', '동구', '동래구', '부산진구', '북구', '사상구'],
    '인천': ['인천전체', '강화군', '영종구', '서해구', '계양구', '미추홀구', '남동구', '제물포구', '부평구', '검단구', '연수구', '옹진군'],
    '대구': ['대구 전체', '중구', '동구', '서구', '남구', '북구', '수성구', '달서구', '달성군', '군위군'],
    '광주': ['광주전체', '광산구', '남구', '동구', '북구', '서구'],
    '대전': ['대전전체', '동구', '서구', '중구', '대덕구', '유성구'],
    '울산': ['울산전체', '남구', '동구', '북구', '울주군', '중구'],
    '세종': ['세종전체', '세종시'],
    '경기': ['경기전체', '가평군', '군포시', '김포시', '고양시',  '남양주시', '동두천시', '부천시', '성남시', '성남시분당구', '성남시수정구', '성남시중원구', '수원시', '수원시권선구', '수원시영통구', '수원시장안구', '수원시팔달구', '시흥시', '안산시', '안산시단원구', '안산시상록구', '안성시', '안양시', '안양시동안구', '안양시만안구', '양주시', '양평군', '여주시', '연천군', '오산시', '용인시', '용인시기흥구', '용인시수지구', '용인시처인구', '의왕시', '의정부시', '이천시', '파주시', '평택시', '포천시', '하남시', '화성시', '과천시', '광명시', '광주시', '구리시'],
    '강원': ['강원전체', '강릉시', '인제군', '정선군', '철원군', '춘천시', '태백시', '평창군', '홍천군', '화천군', '횡성군', '고성군', '동해시', '삼척시', '속초시', '양구군', '양양군', '영월군', '원주시'],
    '충북': ['충북전체', '괴산군', '청주시', '청주시상당구', '청주시서원구', '청주시청원구', '청주시흥덕구', '충주시', '단양군', '보은군', '영동군', '옥천군', '음성군', '제천시', '증평군', '진천군'],
    '충남': ['충남전체', '천안시', '천안시 동남구', '천안시 서북구', '공주시', '보령시', '아산시', '서산시', '논산시', '당진시', '계룡시', '금산군', '부여군', '서천군', '청양군', '홍성군', '예산군', '태안군'],
    '전북': ['전북전체', '고창군', '임실군', '장수군', '전주시', '전주시덕진구', '전주시완산구', '정읍시', '진안군', '군산시', '김제시', '남원시', '무주군', '부안군', '순창군', '완주군', '익산시'],
    '전남': ['전남전체', '강진군', '고흥군', '곡성군', '광양시', '구례군', '보성군', '순천시', '신안군', '여수시', '영광군', '영암군', '완도군', '장성군', '장흥군', '진도군', '함평군', '화순군', '해남군', '나주시', '담양군', '목포시', '무안군'],
    '경북': ['경북전체', '성주군', '안동시', '영덕군', '영양군', '영주시', '영천시', '예천군', '울릉군', '울진군', '의성군', '경주시', '청도군', '청송군', '칠곡군', '포항시', '포항시남구', '포항시북구', '고령군', '구미시', '군위군', '김천시', '문경시', '봉화군', '상주시'],
    '경남': ['경남전체', '거제시', '의령군', '진주시', '창녕군', '창원시', '창원시마산합포구', '창원시마산회원구', '창원시성산구', '창원시의창구', '창원시진해구', '통영시', '거창군', '하동군', '함안군', '함양군', '합천군', '고성군', '김해시', '남해군', '밀양시', '사천시', '산청군', '양산시'],
    '제주': ['제주전체', '서귀포시', '제주시']
};